Repository: ringavirda/fallen-cli
Catalog: FCli/Resources/Strings.*.resx
Languages: ru, uk

# Basic_Help
source: This tool can memorize actions and execute them. Currently supports: Url Script Executable Directory Usage: fcli <tool?> [params ...] [flags ...] fcli add C:\Awesome --exe --name awe fcli awe For more information about the tools use --help. To list all tools or commands use: fcli list fcli list --tool
ru: Этот инструмент может запоминать действия а потом повторять их. Сейчас поддерживает такие виды команд: Url Script Executable Directory Использование: fcli <tool?> [params ...] [flags ...] fcli add C:\Awesome --exe --name awe fcli awe Чтобы получить больше информации про этот инструменту используйте флаг --help. Команды, которые выводят список всех команд/инструментов: fcli list fcli list --tool
uk: Цей інструмент може запам'ятовувати дії, а потім повторювати їх. Зараз підтримує наступні типи команд: Url Script Executable Directory Використання: fcli <tool?> [params ...] [flags ...] fcli add C:\Awesome --exe --name awe fcli awe Щоб отримати більше інформації по цьому інструменту використайте прапорець --help. Команди, які виводять список всіх команд/інструментів: fcli list fcli list --tool

# Full_Help
source: This tool can be used to remember apps, sites and script files, and call them afterwards. This should help with using command line. Syntax: fcli <tool/command> [flags...] Tools: Tools manipulate command storage and do informational work. add - stores new command to storage. remove - deletes a known command from storage. list - displays all known commands or tools. run - performs a command without saving it. config - alters user configuration. group - creates command execution sequences. change - alters existing command. More detailed info about each command can be access by specifying special flag --help after that specific tool. Commands: If given argument doesn't align with a known tool or it's alias it is considered a command. If this command is known, then it gets executed in the most appropriate vay. All known commands can be listed using list tool. Usage: fcli add c:\awesome --exe -name aw fcli aw --options "-s 2" fcli remove aw fcli add https://google.com --name google fcli google
ru: Этот инструмент может быть использован для того, чтобы запоминать приложения, сайты, скрипты, и позже вызывать их по команде. Это должно быть полезным при использовании командной строки. Синтаксис: fcli <tool/command> [flags...] Инструменты: Инструменты управляют хранилищем команд и дополнительными функциями FCli. add - добавляет новые команды в хранилище. remove - удаляет известные команды. list - выводит состояние хранилища. run - выполняет данную команду без валидации и не сохраняя её. config - изменяет пользовательскую конфигурацию. group - создаёт выполняемые последовательности команди. change - изменяет существующую команду. Более детальную информацию об каждом инструменте можно получить использовав на нём флаг --help. Он выведет более подробное описание этого инструмента. Команды: Если аргумент не является одним из известных селекторов инструментов, то он рассматривается как команда. Если эта команда находится в хранилище, то FCli реконструирует её и попытается выполнить наиболее подходящим образом. Все сохранённые команды можно вывести используя инструмент list. Использование: fcli add c:\awesome --exe -name aw fcli aw --options "-s 2" fcli remove aw fcli add https://google.com --name google fcli google
uk: Цей інструмент може бути використаний для того, щоб запам'ятовувати додатки, сайти, скрипти, а потім викликати їх за командою. Це може опинитися доволі корисним при використанні командної строки. Синтаксис: fcli <tool/command> [flags...] Інструменти: Інструменти керують сховищем команд та додатковим функціоналом FCli. add - додає нові команди до зберігання. remove - видаляє відомі команди. list - показує стан сховища. run - виконує команду без валідації да не зберігає її. config - змінює користувацьку конфігурацію. group - створює виконувані послідовності команд. change - змінює існуючу команду. Більш детальну інформацію по кожному інструменту можна отримати вказавши флаг --help після нього. Він виведе більш детальний опис обраного інструменту. Команди: Якщо аргумент не є однім із відомих селекторів команд, то він розглядається як команда. Якщо ця команда знаходитися в сховище, то FCli реконструює її та намагається виконати в найбільш коректний спосіб. Всі збережені команди можна вивести за допомогою інструменту list. Використання: fcli add c:\awesome --exe -name aw fcli aw --options "-s 2" fcli remove aw fcli add https://google.com --name google fcli google

# FCli_MultipleArgs
source: FCli accepts only [tool?] arg, but more then one arg was found.
ru: FCli принимает только [tool?] [arg], но было передано больше одного аргумента.
uk: FCli приймає тільки [tool?] [arg], але було передано більше одного аргументу.

# FCli_CriticalError
source: Something went horribly wrong! [{0}]: {1}
ru: Случилось что-то ужасное! [{0}]: {1}
uk: Трапилось щось дуже погане! [{0}]: {1}

# FCli_UnknownShell
source: Script flag must also specify type of shell. Supported shells: {0}.
ru: Флаг --script должен так же указывать окружение. Поддерживаемые окружения: {0}.
uk: Прапорець --script повинен також вказувати оточення. Підтримувані оточення: {0}.

# FCli_UnknownCommandType
source: ({0}) - isn't a known command type selector.
ru: ({0}) - не есть известным типом команды.
uk: ({0}) - не є відомим типом команди.

# FCli_NameExists
source: ({0}) - is a known command name or tool selector.
ru: ({0}) - это имя известной команды или селектора инструмента.
uk: ({0}) - це ім'я відомої команди або селектора інструменту.

# FCli_UnknownName
source: ({0}) - isn't a known command or group name.
ru: ({0}) - не есть известным именем команды или группы.
uk: ({0}) - не є відомим ім'ям команди або групи.

# FCli_Confirm
source: Are you sure about this?
ru: Вы уверены, что хотите продолжить?
uk: Ви впевнені, що бажаєте продовжити?

# FCli_Averted
source: Operation averted.
ru: Операция предотвращена.
uk: Операція зупинена.

# FCli_Continued
source: Operation continued...
ru: Операция продолжается...
uk: Операція продовжується...

# FCli_ArgMissing
source: ({0}) was called without an argument.
ru: ({0}) был вызван без аргумента.
uk: ({0}) був викликаний без аргументу.

# FCli_UnexpectedArg
source: ({0}) doesn't accept argument, but was given one.
ru: ({0}) не поддерживает аргумент, но получил его.
uk: ({0}) не підтримує аргумент, але отримав його.

# FCli_MultipleTypeFlags
source: ({0}) can accept only one of the type flags.
ru: ({0}) может принят только один флаг типа.
uk: ({0}) може приймати тільки один прапорець типу.

# FCli_CommandNotDetermined
source: The type of command wasn't determined. FCli recognizes only file path or url. You can force execution using type flags. Consult help page for more info.
ru: Тип команды не был определён. FCli может распознать только путь или ссылку. Вы можете напрямую указать тип команды используя флаги типов. Страница помощи содержит больше информации.
uk: Тип команди неможливо визначити. FCli може розпізнати лише шлях або посилання. Ви можете вказати напряму тип через відповідний прапорець. Сторінка допомоги містить більше інформації.

# FCli_Saving
source: Saving to storage...
ru: Запись в хранилище...
uk: Зберігання в сховище...

# FCli_CommandSaved
source: Saved. To use the command/group try: fcli {0}
ru: Сохранено. Чтобы использовать команду/группу попробуйте: fcli {0}
uk: Збережено. Щоб використати команду/групу спробуйте: fcli {0}

# Tool_FlagShouldNotHaveValue
source: Flag (--{0}) shouldn't have any value. To see list of all supported flags for {1} tool consult help page using --help flag.
ru: Флаг (--{0}) не должен иметь никакого значения. Чтобы увидеть список всех поддерживаемых флагов для {1} воспользуйтесь страницей помощи указав флаг --help.
uk: Прапорець (--{0}) не повинен мати ніякого значення. Щоб побачити список всіх відомих прапорців для {1} використайте сторінку допомоги вказавши прапорець --help.

# Tool_FlagShouldHaveValue
source: Flag (--{0}) should have a value. To see list of all supported flags for {1} tool consult help page using --help flag.
ru: Флаг (--{0}) должен иметь значение. Чтобы увидеть список всех поддерживаемых флагов для {1} воспользуйтесь страницей помощи указав флаг --help.
uk: Прапорець (--{0}) повинен мати значення. Щоб побачити список всіх відомих прапорців для {1} використайте сторінку допомоги вказавши прапорець --help.

# Tool_FlagIsUnknown
source: Flag (--{0}) is not a known flag for the {1} tool. To see list of all supported flags for {2} tool consult help page using --help flag.
ru: Флаг (--{0}) не есть флагом инструмента {1}. Чтобы увидеть список всех поддерживаемых флагов для {1} воспользуйтесь страницей помощи указав флаг --help.
uk: Прапорець (--{0}) не є відомим для інструменту {1}. Щоб побачити список всіх відомих прапорців для {1} використайте сторінку допомоги вказавши прапорець --help.

# Tool_UrlIsInvalid
source: ({0}) - is not a valid url.
ru: ({0}) - невалидная ссылка.
uk: ({0}) - посилання некоректне.

# Tool_PathIsInvalid
source: ({0}) - is not a valid system path.
ru: ({0}) - недействительный путь.
uk: ({0}) - недійсний шлях.

# Add_Help
source: Add - validates a new command and adds it to the storage. Requires a valid path or url as an argument. Flags: --script <shell> - the path points to the script file. --exe - the path points to the executable. --url - the argument is a url. --dir - the path points to a directory. --name <value> - explicitly specify the name for the command. --options <args> - options to run exe or script with. --help - show description. Usage: fcli add c:/awesome.exe fcli add .\scripts\script --script bash --name sc
ru: Add - валидирует указанные свойства команды и добавляет её в хранилище. Требует существующий путь или корректную ссылку как аргумент. Флаги: --script <shell> - путь указывает на скриптовый файл. --exe - путь ведёт к выполняемому файлу. --url - аргумент это ссылка на сайт. --dir - путь ведёт к директории. --name <value> - указывает конкретное имя для команды. --options <args> - дополнительные аргументы командой строки. --help - показывает эту страницу. Использование: fcli add c:/awesome.exe fcli add .\scripts\script --script bash --name sc
uk: Add - валідує надані властивості команди та додає її до сховища. Потребує правильне посилання або інснуючий системний шлях як аргумент. Прапорці: --script <shell> - шлях веде до файлу скрипту. --exe - шлях вказує на виконуваний файл. --url - аргументом є посилання на веб сайт. --dir - шлях вказує на директорію. --name <value> - вказує конкретне ім'я для команди. --options <args> - додаткові аргументи командної строки. --help - виводить цю сторінку. Використання: fcli add c:/awesome.exe fcli add .\scripts\script --script bash --name sc

# Add_FileUnrecognized
source: Couldn't recognize the type of file. Please, specify it using type flags. To see the list of type flags use --help.
ru: Невозможно определить тип файла. Пожалуйста, укажите его используя флаг типа. Чтобы увидеть список всех флагов типа, воспользуйтесь --help.
uk: Неможливо визначити тип файлу. Будь ласка, вкажіть його використовуючи прапорець типу. Щоб побачити всі прапорці типу, використайте --help.

# Add_BashOnWindows
source: Command ({0}) is interpreted as a bash script, but Windows operating system is currently running. Bash scripts can be executed on Windows, FCli uses WSL for that. You need to make sure that your system has WSL installed and default distro enabled.
ru: Команда ({0}) была распознана как Bash скрипт, но окружением сейчас является Windows. Bash скрипты могут быть выполнены на Windows, FCli использует WSL для этого. Вам нужно убедиться что ваша Windows имеет подсистему WSL установленную и с включённым стандартным дистрибутивом чтобы это сработало.
uk: Команда ({0}) була розпізнана як Bash скрипт, але оточенням зараз є Windows. Bash скрипти можуть бути виконані на Windows, FCli використовує WSL для цього. Вам потрібно впевнитись що ваша Windows має підсистему WSL встановлену та з включеним стандартним дистрибутивом щоб це спрацювало.

# Add_FishOnWindows
source: Command ({0}) is interpreted as a Fish script, but Windows operating system is currently running. Fish is only supported on Unix-like operating systems.
ru: Команда ({0}) была распознана Fish скрипт, но окружением является операционная система Windows. Fish только поддерживается на Unix-подобных системах.
uk: Команда ({0}) була розпізнана Fish скрипт, але оточенням є операційна система Windows. Fish тільки підтримується на Unix-подібних системах.

# Add_CmdOnLinux
source: Command ({0}) is interpreted as a batch file, but Linux operating system is running. CMD is only supported on Windows.
ru: Команда ({0}) была распознана как Бат файл, но окружением сейчас является операционная система Linux. CMD поддерживается только на Windows.
uk: Команда ({0}) була розпізнана як Батч файл, але оточенням зараз є операційна система Linux. CMD підтримується лише на Windows.

# Add_PowershellOnLinux
source: Command ({0}) is interpreted as a powershell script, but Linux operating system is running. PS scripts can be executed on Linux, but powershell needs to be installed from the packet manager.
ru: Команда ({0}) распознана как Powershell скрипт, но окружением сейчас является операционная система Linux. PS скрипты могут быть запущены на Linux, но powershell должен быть установлен используя ваш пакетный менеджер.
uk: Команда ({0}) розпізнана як Powershell скрипт, але оточенням зараз є операційна система Linux. PS скрипти можуть бути запущені на Linux, але powershell має бути встановленим за допомогою вашого менеджеру пакетів.

# Add_OSScript_Question
source: Can your machine run this type of script?
ru: Вы уверены что ваша система может запустить этот тип скрипта?
uk: Ви впевнені що ваша система може запустити цей тип скрипту?

# Add_ParsedCommand
source: Command was parsed: name - {0} type - {1} shell - {2} path - {3} options - {4}
ru: Команда была реконструирована: name - {0} type - {1} shell - {2} path - {3} options - {4}
uk: Команда була реконструйована: name - {0} type - {1} shell - {2} path - {3} options - {4}

# Config_Help
source: Config tool allows to manipulate current user config. Using this you can change some values store or purge config. List current config state if nothing is specified. Flags: --locale <loc> - sets culture locale for the tool. Supported locales: en, ru, uk. --formatter <type> - sets console formatter to use for messaging. - inline - displays most messages as a single line. - pretty - more verbose and uses multiline templates. --purge - deletes current config. --help - displays help page. Usage: fcli config fcli cnf --locale en --formatter pretty fcli config --purge
ru: Config - позволяет управлять пользовательским конфигурационным файлом. Используя этот инструмент вы можете изменять некоторые значения, или же удалить конфигурационный файл целиком. Флаги: --locale <loc> - указывает культуру которую использовать. Поддерживаемые локали: en, ru, uk. --formatter <type> - устанавливает используемый форматировщик. - inline - склонен показывать сообщения одной строкой. - pretty - более многословен, разноцветный и многострочный. --purge - удаляет существующую конфигурацию. --help - выводит эту страницу.
uk: Config - дозволяє керувати файлом користувацьких налаштувань. Використовуючи цей інструмент ви можете змінювати деякі значення, або цілком видалити конфігураційний файл. Флаги: --locale <loc> - вказує культуру, яку потрібно використовувати. Підтримувані локалі: en, ru, uk. --formatter <type> - встановлює форматувальник командної строки. - inline - має тенденцію показувати все однією строкою. - pretty - більш різнокольоровий, багатослівний та багатостроковий. --purge - видаляє існуючу конфігурацію. --help - виводить цю сторінку.

# Config_ListConfig
source: No flags given, listing current config:
ru: Не указано никаких флагов, вывожу состояние конфигурации:
uk: Не вказано ніяких прапорців, виводжу стан конфігурації:

# Config_Formatter
source: Formatter: {0}
ru: Форматировщик: {0}
uk: Форматувальник: {0}

# Config_Locale
source: Locale: {0}
ru: Локаль: {0}
uk: Локаль: {0}

# Config_UnknownLocale
source: Unsupported locale was specified via --locale flag. To see supported locales consult help page.
ru: Неподдерживаемая локаль была указана через флаг --locale. Чтобы увидеть поддерживаемые локали воспользуйтесь страницей помощи.
uk: Непідтримувана локаль вказана через прапорець --locale. Щоб побачити підтримувані локалі скористайтеся сторінкою допомоги.

# Config_LocaleChangeWarning
source: Preparing to change locale from ({0}) to ({1})...
ru: Смена локали с ({0}) на ({1})...
uk: Зміна локалі з ({0}) на ({1})...

# Config_LocaleChanged
source: Locale changed.
ru: Локаль изменена.
uk: Локаль змінена.

# Config_UnsupportedFormatter
source: Unsupported formatter was specified via --formatter flag. To see supported console formatters consult help page.
ru: Неподдерживаемый форматировщик был указан через флаг --formatter. Чтобы увидеть поддерживаемые форматировщики воспользуйтесь страницей помощи.
uk: Непідтримуваний форматувальник вказано через прапорець --formatter. Щоб побачити підтримувані форматувальники скористайтеся сторінкою допомоги.

# Config_FormatterChangeWarning
source: Preparing to change command line formatter from ({0}) to ({1})...
ru: Смена форматировщика командной строки с ({0}) на ({1})...
uk: Зміна форматувальника командної строки з ({0}) на ({1})...

# Config_FormatterChanged
source: Formatter changed.
ru: Форматировщик изменён.
uk: Форматувальник змінено.

# Config_PurgeWarning
source: You are about to purge your dynamic configuration, all your setups will be lost.
ru: Вы собираетесь очистить файл пользовательской конфигурации, все ваши установки будут утеряны. Вы уверены, что вы хотите продолжить?
uk: Ви збираєтесь видалити файл конфігурації, всі ваші налаштування будуть втрачені. Ви впевнені, що ви бажаєте продовжити?

source: Config purged.
ru: Конфигурацию очищено.
uk: Конфігурацію очищено.

# List_Help
source: List - echos existing commands to the console based on the selection given by flags. If no flags given - lists all existing commands. Arg is used as filter for this tool. Flags: Commands: --script - adds scripts to listing. --exe - adds executables to listing. --url - adds urls to listing. --dir - adds directories to listing. Special: --tools - lists available tool selectors. --shells - lists supported shell types. --types - lists known command types. --groups - adds groups to listing. --help - show description. Usage: fcli list fcli list --tools fcli ls --script --url
ru: List - выводит в консоль списки известных команд/инструментов зависимо от указанных флагов. Выводит все команды, если флаги не указаны. Аргумент используется как фильтр для этого инструмента. Флаги: Команды --script - добавляет скрипты в список. --exe - добавляет исполняемые файлы в список. --url - добавляет сайты в список. --dir - добавляет директории в список. Специальные: --tools - выводит известные селекторы инструментов. --shells - выводит поддерживаемые типы окружения. --types - выводит известные типы команд. --groups - добавляет группы в список. --help - показывает эту страницу. Использование: fcli list fcli list --tools fcli ls --script --url
uk: List - виводить в консоль список відомих команд або інструментів залежно від вказаних прапорців. Виводить всі команди, якщо вони не вказані. Використовує аргумент як фільтр. Аргумент використовується як фільтр для цього інструменту. Прапорці: Команди --script - додає файли скриптів до списку. --exe - додає виконувані файли до списку. --url - додає вебсайти до списку. --dir - додає директорії до списку. Спеціальні: --tools - виводить доступні селектори інструментів. --shells - виводить підтримувані типи оточення. --types - виводить відомі типи команд. --groups - додає групи до списку. --help - виводить цю сторінку. Використання: fcli list fcli list --tools fcli ls --script --url

# List_NoCommands
source: There are no known commands.
ru: Сейчас в хранилище нет известных команд.
uk: Зараз сховище не має відомих команд.

# List_ListAllCommands
source: No flags given, listing all commands:
ru: Никаких флагов не указано, выводим все команды:
uk: Ніяких прапорців не вказано, виводжу всі команди:

# List_ListCommands
source: Listing all commands of type ({0}):
ru: Список всех команд типа ({0}):
uk: Список всіх команд типу ({0}):

# List_NoCommandsSelected
source: There are no known commands of type ({0}).
ru: В системе не записано команд ({0}) типа.
uk: В системі не записано команд типу ({0}).

# List_Tools
source: Known tool selectors:
ru: Список всех известных селекторов инструментов:
uk: Список всіх відомих селекторів інструментів:

# List_NothingFiltered
source: No commands were found with given filter: {0}
ru: Не было найдено команд подходящих под фильтр: {0}
uk: Не було знайдено команд які підходять для фільтру: {0}

# Remove_Help
source: Remove - deletes command from storage. Flags: --yes - skip confirmation. --all - removes all known commands. --help - show description. Usage: fcli remove awesome --yes
ru: Remove - удаляет команду из хранилища. Флаги: --yes - пропускает подтверждение. --all - удаляет все команды (непропускаемое подтверждение). --help - показывает эту страницу. Использование: fcli remove awesome --yes
uk: Remove - видаляє команди зі сховища. Прапорці: --yes - опускає підтвердження. --all - видаляє всі відомі команди (непропускне підтвердження). --help - виводить цю сторінку. Використання: fcli remove awesome --yes

# Remove_AllWarning
source: All flag: preparing to delete all known commands.
ru: Флаг (--all): вы собираетесь удалить все команды из хранилища. Вы уверены?
uk: Прапорець (--all): ви намагаєтесь видалити всі команди зі зберігання. Ви впевнені?

# Remove_NoCommands
source: There are no commands to delete!
ru: В хранилище нет команд!
uk: Сховище не має команд!

# Remove_AllDeleted
source: All existing commands have been deleted.
ru: Все существующие команды были удалены.
uk: Всі існуючи команди були видалені.

# Remove_Warning
source: Preparing to delete {0} command.
ru: Команда ({0}) будет удалена. Вы уверены?
uk: Команда ({0}) буде видалена. Ви впевнені?

# Remove_Deleted
source: Command ({0}) was successfully deleted.
ru: Команда ({0}) была успешно удалена.
uk: Команда ({0}) була успішно видалена.

# Run_Help
source: Run - executes given path or url without saving. Useful for testing. Requires path or url, as well as explicit specification of run type through a flag. Flags: --script <shell> - run as script. --exe - run as executable. --url - run as url. --dir - run as dir. --help - show description. Usage: fcli run c:/awesome --script powershell fcli run https://awesome.com --url
ru: Run - выполняет данный путь или ссылку без валидации и сохранения. Полезно для тестирования. Требует путь или ссылку, а так же конкретно указанный тип команды через соответствующий флаг. Флаги: --script <shell> - запустить как скрипт. --exe - запустить как выполняемый файл. --url - запустить как ссылку. --dir - открыть как директорию. --help - показать эту страницу. Использование: fcli run c:/awesome --script powershell fcli run https://awesome.com --url
uk: Run - виконує даний аргумент без валідації та зберігання. Корисно для тестування. Потребує шлях або посилання, а також конкретно вказаний тип команди через прапорці типу. Прапорці: --script <shell> - виконує як скрипт. --exe - виконує як виконуваний файл. --url - виконує як посилання. --dir - відкрити як директорію. --help - виводить цю сторінку. Використання: fcli run c:/awesome --script powershell fcli run https://awesome.com --url
