Repository: ringavirda/fallen-cli
Catalog: FCli/Resources/Strings.*.resx
Languages: ru, uk

# Run_UnknownCommand
source: Command type wasn't recognized. Please specify it using a type flag. To see Run syntax and available type flags use --help.
ru: Тип команды не был распознан, пожалуйста, укажите его используя флаг типа. Чтобы увидеть использование Run укажите флаг --help.
uk: Тип команди не був встановлений, будь ласка, вкажіть його використовуючи прапорець типу. Щоб побачити використання Run вкажіть прапорець --help.

# Command_UnsupportedShell
source: ({0}) cannot be run on ({1}) systems!
ru: ({0}) не могут быть запущены на системах ({1})!
uk: ({0}) не можуть бути запущені на системах ({1})!

# Command_UnsupportedShellWarning
source: Attempting to execute ({0}) on ({1})...
ru: Попытка запуска ({0}) на ({1})...
uk: Спроба запуску ({0}) на ({1})...

# Group_Help
source: Group tool can associate known commands into executable sequence. In this way, you can specify collections on commands that all will be executed. To create a group, you need to list all commands you want executed separated by spaces and in quotes. (--name) flag is mandatory. This tool also manipulates groups via flags. Flags: --name <name> - creates a new group with this name. --remove - deletes specified command (arg is a group name). --all - in conjunction with remove deletes all groups. --override <name> - changes group of the specified name. --yes - skips confirmations. --help - displays help page. Usage: fcli group "cmd1 cmd2" --name mygr fcli gr "cmd1 cmd2 cmd3" --override mygr --yes fcli group mygr --remove
ru: Инструмент Group может собирать команды в выполняемые последовательности. Таким образом, вы можете указывать коллекции команд, которые будут выполнены. Чтобы создать группу, вам нужно указать все команды в последовательности, которая вам нужна, разделив их пробелом и взяв в кавычки. (--name) флаг обязателен. Этот инструмент может изменять группы используя флаги. Флаги: --name <name> - создаёт новую группу с этим именем. --remove - удаляет оказанную команду (аргумент это имя группы в этом случае, подтверждение). --all - вместе с remove удаляет все группы (подтверждение обязательно). --override <name> - изменяет последовательность указанной группы. --yes - пропускает подтверждение. --help - выводит эту страницу. Использование: fcli group "cmd1 cmd2" --name mygr fcli gr "cmd1 cmd2 cmd3" --override mygr --yes fcli group mygr --remove
uk: Інструмент Group може збирати команди у виконувані послідовності. Таким чином, ви можете вказувати колекції команд, які потрібно виконати. Щоб створити групу потрібно вказати послідовність команд розділених пробілом та взяті в лапки. (--name) прапорець обов'язковий. Цей інструмент може змінювати групи, використовуючи прапорці. Прапорці: --name <name> - створює групу з цим ім'ям. --remove - видаляє існуючу групу (в цьому випадку аргумент - це ім'я групи, підтвердження). --all - разом з remove видаляє всі групу (підтвердження обов'язково). --override <name> - змінює послідовність вказаної групи. --yes - пропускає підтвердження. --help - виводить цю сторінку. Використання: fcli group "cmd1 cmd2" --name mygr fcli gr "cmd1 cmd2 cmd3" --override mygr --yes fcli group mygr --remove

# Group_Constructed
source: Group was parsed and constructed: name - {0} sequence - {1}
ru: Группа сконструирована: name - {0} sequence - {1}
uk: Група сконструйована: name - {0} sequence - {1}

# Group_OverrideWarning
source: You are about to override group ({0}) with given sequence.
ru: Вы намереваетесь перезаписать группу ({0}) указанной последовательностью.
uk: Ви намагаєтесь перезаписати групу ({0}) Вказаній послідовністю.

# Group_RemoveAllWarning
source: All flag: you are about to delete all existing command groups.
ru: Флаг All: вы намереваетесь удалить все известные группы команд.
uk: Прапорець All: ви намагаєтесь видалити всі групу зі зберігання.

# Group_RemovedAll
source: All groups were removed from storage.
ru: Все группы команд были удалены из хранилища.
uk: Всі групи команд були видалені.

# Group_NoGroups
source: There are no groups to remove!
ru: Группы не были найдены!
uk: Групи не були знайдені!

# Group_Removed
source: Group ({0}) was deleted.
ru: Группа ({0}) была удалена.
uk: Група ({0}) була видалена.

# Group_NotAGroup
source: ({0}) is not a group!
ru: ({0}) не является группой!
uk: ({0}) не є групою!

# Change_Help
source: Change - enables altering of existing commands. Argument is always a command name and new values are provided using flags. To change group sequence use group tool. Attention!!! This tool will allow you to change types and names - that may break command execution or associated groups. Also it doesn't perform validation on path. Use these options with care. Flags: --name - new command name. --path - new path. --type - new command type. --shell - new shell type. --options - new command line options. --help - displays this page. Usage: fcli change awesome --name newName --type script --shell bash fcli ch newName --type exe --path /new/path
ru: Change - разрешает изменять известные команды. Аргумент это всегда имя команды которую нужно изменить, а новые значения задаются через флаги. Чтобы изменять последовательности групп используйте инструмент group. Внимание!!! Этот инструмент позволит изменить вам типы и имена - это может сломать как выполнение так и связанные группы. Так же он позволяет установит путь без валидации. Используйте этот инструмент с осторожностью. Флаги: --name - новое имя команды. --path - новый путь. --type - новый тип команды. --shell - новый тип окружения. --options - новые опции командной строки. --help - выводит эту страницу. Использование: fcli change awesome --name newName --type script --shell bash fcli ch newName --type exe --path /new/path
uk: Change - дозволяє змінювати відомі команди. Аргумент - це завжди ім'я команди, яку потрібно змінювати, а нові значення задаються через прапорці. Щоб змінювати послідовності в групах використовуйте інструмент group. Увага!!! Цей інструмент дозволяє вам змінювати імена й типи - це може зламати як виконання команди, так і пов'язані групи. Також він дозволяє встановити шлях без валідації. Використовуйте цей інструмент обережно. Прапорці: --name - нове ім'я команди. --path - новий шлях. --type - новий тип команди. --shell - новий тип оточення. --options - нові опції командної строки. --help - виводить цю сторінку. Використання: fcli change awesome --name newName --type script --shell bash fcli ch newName --type exe --path /new/path

# Change_NameWarning
source: Preparing to change name on command ({0}). Attention: This might break groups! New name: {1}
ru: Зафиксировано изменение имени для команды ({0}). Внимание: Это может сломать группы! Новое имя: {1}
uk: Зафіксовано зміну ім'я для команди ({0}). Увага: Це може зламати групи! Нове ім'я: {1}

# Change_PathWarning
source: Preparing to change path on command ({0}). Attention: Change doesn't validate path! New Path: {1}
ru: Зафиксировано изменение пути для команды ({0}). Внимание: Change не проверяет путь! Новый путь: {1}
uk: Зафіксована зміна шляху команди ({0}). Увага: Change не перевіряє шлях! Новий шлях: {1}

# Change_TypeWarning
source: Preparing to change command type on command ({0}). Attention: This will change how command is executed! New type: {1}
ru: Зафиксировано изменение типа для команды ({0}). Внимание: Это изменит каким образом команда выполняется! Новый тип: {1}
uk: Зафіксована зміна типу команди ({0}). Увага: Це змінить яким чином команда буде виконуватись ! Новий тип: {1}

# Change_ShellWarning
source: Preparing to change shell type on command ({0}). Attention: This may break command execution! New shell: {1}
ru: Зафиксировано изменение окружения для команды ({0}). Внимание: Это может сломать выполннение команды! Новое окружение: {1}
uk: Зафіксовано зміну оточення для команди ({0}). Увага: це може зламати виконування команди! Нове оточення: {1}

# Change_OptionsWarning
source: Preparing to command line options on command ({0}). Attention: This may affect the command execution! New options: {1}
ru: Зафиксировано изменение опций для команды ({0}). Внимание: Это может повлиять на выполнение команды! Новые опции: {1}
uk: Зафіксовано зміну опцій командної строки для команди ({0}). Увага: Це може повпливати на виконання команди! Нові опції: {1}

# Change_NoChange
source: You haven't specified anything to change! Use flags to set new values for the command.
ru: Вы не указали ничего что нужно изменить! Используйте флаги для того чтобы указать изменяемые свойства.
uk: Ви не вказали нічого, що треба змінити! Використовуйте прапорці для того щоб задати нові властивості.

# Change_NewCommandProfile
source: New command profile formed: name: old:{0} new:{1} path: old:{2} new:{3} type: old:{4} new:{5} shell: old:{6} new:{7} options: old:{8} new:{9}
ru: Был сформирован новый профиль команды: name: old:{0} new:{1} path: old:{2} new:{3} type: old:{4} new:{5} shell: old:{6} new:{7} options: old:{8} new:{9}
uk: Був сформован новий профіль команди: name: old:{0} new:{1} path: old:{2} new:{3} type: old:{4} new:{5} shell: old:{6} new:{7} options: old:{8} new:{9}

# Change_Same
source: The same.
ru: То же самое.
uk: Те ж саме.

# Change_Warning
source: Command ready to be reconstructed and overridden.
ru: Команда готова для реконструирования и перезаписи.
uk: Команда готова до реконструювання та перезапису.
